src/cf/Enums/СтатусОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Частичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитывается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусОплаты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Сравнить(Значение1, Значение2) Экспорт
	
	ВесЗначений = Новый Соответствие;
	ВесЗначений.Вставить(Перечисления.СтатусОплаты.НеУчитывается, 0);
	ВесЗначений.Вставить(Перечисления.СтатусОплаты.Отсутствует, 0);
	ВесЗначений.Вставить(Перечисления.СтатусОплаты.Частичная,   1);
	ВесЗначений.Вставить(Перечисления.СтатусОплаты.Полная,      2);
	
	Если ВесЗначений.Получить(Значение1) = Неопределено ИЛИ ВесЗначений.Получить(Значение2) = Неопределено Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru='Не определена операция сравнения для переданных значений: ""%1"", ""%2""'"), Значение1, Значение2);
	КонецЕсли;
	
	Возврат ВесЗначений.Получить(Значение1) - ВесЗначений.Получить(Значение2);
	
КонецФункции

Функция НовыйСтатусОплаты(ПроцентОплаты) Экспорт
	
	Если ПроцентОплаты = 0 Тогда
		Возврат Перечисления.СтатусОплаты.Отсутствует;
	ИначеЕсли ПроцентОплаты > 0 И ПроцентОплаты < 100 Тогда
		Возврат Перечисления.СтатусОплаты.Частичная;
	ИначеЕсли ПроцентОплаты = 100 Тогда
		Возврат Перечисления.СтатусОплаты.Полная;
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#КонецЕсли
